/*delete*/

start(Q,N,A):-					%Запуск от нулевого индекса
    delete(Q,0,N,A).

delete([], _,_ ,[]).			%Случай с пустым списком
delete([_|T], J, I, A):-		%Если индекс индекс меньше или равен I, то идем дальше по списку
    J > I, !,
    J1 is J + 1,
    delete(T, J1, I, A).
delete([X|T], J, I, [X|T2]):-	%Если шндекс больше,то сохраняем элемент в новый список и идем дальше
    J =< I, !,
    J1 is J + 1,
    delete(T, J1, I, T2).


% ?-start([1,4,2,3,8],3,[3,8]). => false
% ?-start([1,4,2,3,8],2,L1). =>L1 = [1, 4, 2]
