
just([], []).					%Собираем первые элементы строк начальной матрицы и помещаем их в первую строку транспонированной
just([[H|_]|T], [H|T1]) :-
  just(T, T1).

next_column([], []).					%Удаляем первые эелементы всех строк изначальной матрицы
next_column([[_|T]|TTs], [T|Ts]) :-
  next_column(TTs, Ts).

transpose([[]|_], []).			%Случай с пустой матрицей
transpose(Matrix, [T|Ts]) :-	%Стартовый предикат; смотрим Матрицу (первые элементы строк) и запоняем соответствующий столбец
  just(Matrix, T),
  next_column(Matrix, Next),
  transpose(Next, Ts).
