/*Fibonacci number*/

/*
F(0,0).     %Нулевой элемент по поределению равен 1 - F(0,1)
F(1,1).
F(N,X):- 
   N1=N-1,  %знак равенстра, а не присваивания - N1 is N-1
   N2=N-2,  %знак равенстра, а не присваивания - N2 is N-2
   X=X1+X2, %функции, вычисляющие X1 и X2 еще не были запущены, сначала нужно вычислить F(N1,X1) и F(N2,X2), только после складывать их, чтобы пулучить текущий 
   F(N1,X1),
   F(N2,X2).
 */  
 
 
 
 
/*  1, 1, 2, 3, 5, 8, 13, 21, …
С:
 {
    if(n == 0) return 0;
    if(n == 1 || n == 2) return 1;
 
    return f(n-1)+f(n-2);
}
 Норм код
    func(N,F):-
    N>2,
    N1 is N-1, 
    N2 is N-2,
    func(N1,X1),
    func(N2,X2),
    F is X1+X2;   
    F is 1. */

