
search([H|_],1,H).		%Случай,когда искомый элемент находится в голове 
search([_|T],N,I):-		%Поиск элемента по индексу I; если не совпадает, то крутим дальше, совпадает - сохраняем
    N_ is N-1,
    search(T,N_,I).



replace([_|T], 0, X, [X|T]).	%Случай, когда нужный элемент первый
replace([H|T], I, X, [H|R]):- 	%Замена значений с заданными индексами; когда находим J индекс запускаем предикат от него
    I > 0,
    I1 is I-1,
    replace(T, I1, X, R).


start(Q,I,J,A):-			%Стартовый предикат
    search(Q,I,Tmp),
    replace(Q,J,I,A).
