/*Selection sort*/

/*   1.Находим min
	 2.Удаляем его из списка
     3.Оставшийся список сортируем.
	 4.Приписываем минимальный элемент в качестве головы к отсортированному списку.*/




min([L|Ls], Min) :- 		%Первый элемент становиться минимальным
    min(Ls, L, Min).
min([], Min, Min).			%Список, если список из одного элемента
min([L|Ls], Min0, Min) :-	%Сравниваем, находим минимальный
    Min1 is min(L, Min0),
    min(Ls, Min1, Min). %works


del(_,[],[]).				%Удаление минимального элеменка
del(H,[H|T],T).
del(X,[H|T],[H|T_]):-
    del(X,T,T_). %works

copy(A,[],[A]).				%Присоединяем минимальный элемент к неотсортированному списку
copy(X,[H|T],[H|T1]):- 
    copy(X,T,T1).

ssort([],_).    			%Случай с пустым листом
ssort([],[]).
ssort(Q,Ans):-				%Стартовый предикат
	min(Q,Min),
    del(Min,Q,Q1),
    ssort(Q1,Q2),
    copy(Min,Q2,Ans).

